docs/test/results/20260321/k6-knee/comment-vus150-after-fix-serial.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 45s max duration (incl. graceful stop):
              * default: 150 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 150/150 VUs, 519 complete and 0 interrupted iterations
default   [   7% ] 150 VUs  01.0s/15s

running (02.0s), 150/150 VUs, 1327 complete and 0 interrupted iterations
default   [  13% ] 150 VUs  02.0s/15s

running (03.0s), 150/150 VUs, 2218 complete and 0 interrupted iterations
default   [  20% ] 150 VUs  03.0s/15s

running (04.0s), 150/150 VUs, 3423 complete and 0 interrupted iterations
default   [  27% ] 150 VUs  04.0s/15s

running (05.0s), 150/150 VUs, 4410 complete and 0 interrupted iterations
default   [  33% ] 150 VUs  05.0s/15s

running (06.0s), 150/150 VUs, 5545 complete and 0 interrupted iterations
default   [  40% ] 150 VUs  06.0s/15s

running (07.0s), 150/150 VUs, 6331 complete and 0 interrupted iterations
default   [  47% ] 150 VUs  07.0s/15s

running (08.0s), 150/150 VUs, 7134 complete and 0 interrupted iterations
default   [  53% ] 150 VUs  08.0s/15s

running (09.0s), 150/150 VUs, 8254 complete and 0 interrupted iterations
default   [  60% ] 150 VUs  09.0s/15s

running (10.0s), 150/150 VUs, 9336 complete and 0 interrupted iterations
default   [  66% ] 150 VUs  10.0s/15s

running (13.0s), 150/150 VUs, 10502 complete and 0 interrupted iterations
default   [  73% ] 150 VUs  11.0s/15s

running (14.0s), 150/150 VUs, 11593 complete and 0 interrupted iterations
default   [  80% ] 150 VUs  12.0s/15s

running (15.0s), 150/150 VUs, 12758 complete and 0 interrupted iterations
default   [  86% ] 150 VUs  13.0s/15s

running (16.0s), 150/150 VUs, 13948 complete and 0 interrupted iterations
default   [  93% ] 150 VUs  14.0s/15s

running (17.0s), 150/150 VUs, 15191 complete and 0 interrupted iterations
default   [ 100% ] 150 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 15369   898.273704/s
    checks_succeeded...: 100.00% 15369 out of 15369
    checks_failed......: 0.00%   0 out of 15369

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=165.29ms min=6.12ms med=136.18ms max=1.42s    p(90)=296.75ms p(95)=358.24ms p(99)=1.12s   
      { expected_response:true }...: avg=165.29ms min=6.12ms med=136.18ms max=1.42s    p(90)=296.75ms p(95)=358.24ms p(99)=1.12s   
    http_req_failed................: 0.00%  0 out of 15369
    http_reqs......................: 15369  898.273704/s

    EXECUTION
    iteration_duration.............: avg=146.8ms  min=6.23ms med=136.43ms max=615.17ms p(90)=284.04ms p(95)=328.43ms p(99)=453.06ms
    iterations.....................: 15369  898.273704/s
    vus............................: 150    min=150        max=150
    vus_max........................: 150    min=150        max=150

    NETWORK
    data_received..................: 24 MB  1.4 MB/s
    data_sent......................: 2.3 MB 135 kB/s



running (17.1s), 000/150 VUs, 15369 complete and 0 interrupted iterations
default ✓ [ 100% ] 150 VUs  15s