docs/test/results/20260321/k6-knee/comment-vus150-after-fix.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 45s max duration (incl. graceful stop):
              * default: 150 looping VUs for 15s (gracefulStop: 30s)


running (00.9s), 150/150 VUs, 133 complete and 0 interrupted iterations
default   [   6% ] 150 VUs  00.9s/15s

running (01.9s), 150/150 VUs, 361 complete and 0 interrupted iterations
default   [  13% ] 150 VUs  01.9s/15s

running (02.9s), 150/150 VUs, 596 complete and 0 interrupted iterations
default   [  19% ] 150 VUs  02.9s/15s

running (03.9s), 150/150 VUs, 907 complete and 0 interrupted iterations
default   [  26% ] 150 VUs  03.9s/15s

running (04.9s), 150/150 VUs, 1190 complete and 0 interrupted iterations
default   [  33% ] 150 VUs  04.9s/15s

running (05.9s), 150/150 VUs, 1529 complete and 0 interrupted iterations
default   [  39% ] 150 VUs  05.9s/15s

running (06.9s), 150/150 VUs, 1837 complete and 0 interrupted iterations
default   [  46% ] 150 VUs  06.9s/15s

running (07.9s), 150/150 VUs, 2170 complete and 0 interrupted iterations
default   [  53% ] 150 VUs  07.9s/15s

running (08.9s), 150/150 VUs, 2358 complete and 0 interrupted iterations
default   [  59% ] 150 VUs  08.9s/15s

running (09.9s), 150/150 VUs, 2556 complete and 0 interrupted iterations
default   [  66% ] 150 VUs  09.9s/15s

running (10.9s), 150/150 VUs, 2798 complete and 0 interrupted iterations
default   [  73% ] 150 VUs  10.9s/15s

running (11.9s), 150/150 VUs, 3172 complete and 0 interrupted iterations
default   [  79% ] 150 VUs  11.9s/15s

running (12.9s), 150/150 VUs, 3492 complete and 0 interrupted iterations
default   [  86% ] 150 VUs  12.9s/15s

running (13.9s), 150/150 VUs, 3810 complete and 0 interrupted iterations
default   [  93% ] 150 VUs  13.9s/15s

running (14.9s), 150/150 VUs, 4228 complete and 0 interrupted iterations
default   [  99% ] 150 VUs  14.9s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 4414    287.211461/s
    checks_succeeded...: 100.00% 4414 out of 4414
    checks_failed......: 0.00%   0 out of 4414

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=510.52ms min=13.65ms med=462.1ms  max=1.59s p(90)=879.46ms p(95)=1.02s p(99)=1.3s
      { expected_response:true }...: avg=510.52ms min=13.65ms med=462.1ms  max=1.59s p(90)=879.46ms p(95)=1.02s p(99)=1.3s
    http_req_failed................: 0.00%  0 out of 4414
    http_reqs......................: 4414   287.211461/s

    EXECUTION
    iteration_duration.............: avg=515.6ms  min=14.09ms med=468.07ms max=1.75s p(90)=887.27ms p(95)=1.03s p(99)=1.3s
    iterations.....................: 4414   287.211461/s
    vus............................: 150    min=150       max=150
    vus_max........................: 150    min=150       max=150

    NETWORK
    data_received..................: 6.9 MB 451 kB/s
    data_sent......................: 662 kB 43 kB/s



running (15.4s), 000/150 VUs, 4414 complete and 0 interrupted iterations
default ✓ [ 100% ] 150 VUs  15s